wmy2370cn/nxp-lpc/NXP-LPC/V7/Bsp/LPC2468/nic_bsp.c


#include <includes.h>
#include <netif/ethernetif.h>
#include "lwipopts.h"

#include "applib.h"
#include "emac.h"
#include "emac_def.h"
#include "dm9161.h"	
#include "dm9161_def.h"
#include "ioLPC24xx.H" 
#include <LPC24xx.H>

#define  DM9161AE_INIT_AUTO_NEG_RETRIES        3

#define  DM9161AE_OUI                   0x00606E
#define  DM9161AE_VNDR_MDL                  0x08

 
#define MAX_ADDR_LEN 6
struct rt_lpc24xx_eth
{
	/* inherit from ethernet device */
	struct eth_device parent;

	/* interface address info. */
	INT8U  dev_addr[MAX_ADDR_LEN];			/* hw address	*/
};

typedef struct {                        /* RX Descriptor struct              */
	INT32U Packet;
	INT32U Ctrl;
} RX_Desc;

typedef struct {                        /* RX Status struct                  */
	INT32U Info;
	INT32U HashCRC;
} RX_Stat;

typedef struct {                        /* TX Descriptor struct              */
	INT32U Packet;
	INT32U Ctrl;
} TX_Desc;

typedef struct {                        /* TX Status struct                  */
	INT32U Info;
} TX_Stat;

static            RX_Desc *rb_descriptors ;
static            TX_Desc *tb_descriptors ;

static  RX_Stat *Rx_Stat ; /* Must be 8-Byte alligned   */
static  TX_Stat *Tx_Stat ;
static  INT8U       *RxBufBaseAddr;
static  INT8U       *TxBufBaseAddr;

#define  EMAC_RX_DESC_BASE_ADDR                (EMAC_RAM_BASE_ADDR)
#define  EMAC_RX_STATUS_BASE_ADDR              (EMAC_RX_DESC_BASE_ADDR   + (NUM_RX_FRAG * sizeof(RX_Desc)))
#define  EMAC_TX_DESC_BASE_ADDR                (EMAC_RX_STATUS_BASE_ADDR + (NUM_RX_FRAG * sizeof(RX_Stat)))
#define  EMAC_TX_STATUS_BASE_ADDR              (EMAC_TX_DESC_BASE_ADDR   + (NUM_TX_FRAG * sizeof(TX_Desc)))
#define  EMAC_RX_BUFF_BASE_ADDR                (EMAC_TX_STATUS_BASE_ADDR + (NUM_TX_FRAG * sizeof(TX_Stat)))
#define  EMAC_TX_BUFF_BASE_ADDR                (EMAC_RX_BUFF_BASE_ADDR   + (NUM_RX_FRAG * ETH_FRAG_SIZE))
 
static struct rt_lpc24xx_eth lpc24xx_device;

//static struct rt_semaphore tx_sem;
static OS_EVENT * tx_sem;


//  function added to initialize Rx Descriptors
void rx_descr_init (void)
{
	/* Initialize Receive Descriptor and Status array. */
	unsigned int i = 0;

	rb_descriptors      =  (RX_Desc *)(EMAC_RX_DESC_BASE_ADDR);
 	Rx_Stat            =  (RX_Stat  *)(EMAC_RX_STATUS_BASE_ADDR);
 	RxBufBaseAddr       =  (INT8U *)(EMAC_RX_BUFF_BASE_ADDR);
 
	for (i = 0; i < NUM_RX_FRAG; i++) 
	{ 
		rb_descriptors[i].Packet  = (INT32U)(RxBufBaseAddr + (i * ETH_FRAG_SIZE));
		rb_descriptors[i].Ctrl    = RCTRL_INT | (ETH_FRAG_SIZE-1);
		Rx_Stat[i].Info    = 0;
		Rx_Stat[i].HashCRC = 0;
	}

	/* Set EMAC Receive Descriptor Registers. */
	MAC_RXDESCRIPTOR    = (INT32U)&rb_descriptors[0];
	MAC_RXSTATUS        = (INT32U)&Rx_Stat[0];
 
	MAC_RXDESCRIPTORNUM = NUM_RX_FRAG-1;

	/* Rx Descriptors Point to 0 */
	MAC_RXCONSUMEINDEX  = 0;
}


//  function added to initialize Tx Descriptors
void tx_descr_init (void) 
{
	unsigned int i;

	tb_descriptors      =  (TX_Desc *)(EMAC_TX_DESC_BASE_ADDR);
	Tx_Stat            =  (TX_Stat  *)(EMAC_TX_STATUS_BASE_ADDR);
	TxBufBaseAddr       =  (INT8U *)(EMAC_TX_BUFF_BASE_ADDR);

	for (i = 0; i < NUM_TX_FRAG; i++) 
	{
		tb_descriptors[i].Packet =  (INT32U)(TxBufBaseAddr + (i * ETH_FRAG_SIZE));
		tb_descriptors[i].Ctrl   = 0;
		Tx_Stat[i].Info   = 0;
	}

	/* Set EMAC Transmit Descriptor Registers. */
	MAC_TXDESCRIPTOR    = (INT32U)&tb_descriptors[0];
	MAC_TXSTATUS        = (INT32U)&Tx_Stat[0];
	MAC_TXDESCRIPTORNUM = NUM_TX_FRAG-1;

	/* Tx Descriptors Point to 0 */
	MAC_TXPRODUCEINDEX  = 0;
}
static  void  EMAC_RxPktDiscard ( )
{
	MAC_RXCONSUMEINDEX      = (MAC_RXCONSUMEINDEX + 1) % NUM_RX_FRAG;
}
/*********************************************************************************************************
** 函数名称: nic_isr_handler
** 函数名称: nic_isr_handler
**
** 功能描述：  interrupt service routine
**
** 输　入:  int vector
**          
** 输　出:   void
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年8月11日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
void nic_isr_handler( int vector )
{
//    INT32U status   =  (MAC_INTSTATUS & MAC_INTENABLE);
    INT32U status               =  MAC_INTSTATUS;    
	INT16U  n_new;
	INT32U  nRsv =  MAC_RSV;
	INT32U  nSta =  MAC_STATUS;

    if (status & INT_RX_DONE) // if receive packet
    {
		INT8U result;
		MAC_INTCLEAR = status;
		/* a frame has been received */
		result = eth_device_ready(&(lpc24xx_device.parent));
		if (result != OS_TRUE)
		{//如果发送失败,那么说明队列满了,处理不过来,那么就把这封信扔掉
			EMAC_RxPktDiscard();
		}
 		MAC_INTCLEAR            = (INT_RX_DONE);                            /* Clear the interrupt flags        */
    }

	/* check for receive overrun */
	if (status & INT_RX_OVERRUN)
	{
		MAC_INTCLEAR = INT_RX_OVERRUN;
	//	eth->rx_overrun++;
		MAC_COMMAND |= CR_RX_RES;
		/* usleep(?); */
		MAC_COMMAND |= CR_RX_EN;
		MAC_MAC1 |= MAC1_REC_EN;
	}
	/* check for transmit underrun */
	if (status & INT_TX_UNDERRUN)
	{
		MAC_INTCLEAR = INT_TX_UNDERRUN;
	//	eth->tx_underrun++;
		MAC_COMMAND |= CR_TX_RES;;
		/* usleep(?); */
		MAC_COMMAND |= CR_TX_EN;
	}

	//???????????
	VICVectAddr = 0;            //interrupt close 通知中断控制器中断结束
}


INT8U   NetIF_MAC_Addr[NET_IF_ADDR_SIZE];      /* NIC's MAC addr.                                      */
/*********************************************************************************************************
** 函数名称: SetMacID
** 函数名称: SetMacID
**
** 功能描述：  设置芯片物理地址,物理地址已经存储在程序空间内 
**
** 输　入:  INT8U * mac_ptr
**          
** 输　出:   void
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年7月30日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
void set_mac_id( )   
{
	MAC_SA0   =  (NetIF_MAC_Addr[5] << 8) |(NetIF_MAC_Addr[4]);                   /* Write the MAC Address, octect 2 and 1 to the EMAC        */
	MAC_SA1   =  (NetIF_MAC_Addr[3] << 8) |(NetIF_MAC_Addr[2]);                   /* Write the MAC Address, octect 4 and 3 to the EMAC        */
	MAC_SA2  =  (NetIF_MAC_Addr[1] << 8) | (NetIF_MAC_Addr[0]);                  /* Write the MAC Address, octect 6 and 5 to the EMAC        */
 }

static  void  AppInitTCPIP (void)
{  
	NetIF_MAC_Addr[0] = 0x00;
	NetIF_MAC_Addr[1] = 0x28;
	NetIF_MAC_Addr[2] = 0x6c;
	NetIF_MAC_Addr[3] = 0xa2;
	NetIF_MAC_Addr[4] = 0x35;
	NetIF_MAC_Addr[5] = 0x1e;

