wmy2370cn/nxp-lpc/NXP-LPC/V7/Bsp/LPC2468/nic_bsp.c
	return (clk_freq);
}
 
void rt_delayms(INT32U ms)
{
	//执行11059200次语句，花时3.570S，差不多每ms计算3097条语句
	INT32U count=3339*ms;
	INT32U i;
	for (i=0;i<count;i++)
	{
		__asm{ NOP };
	}
}


void  nic_int_init  (void)
{
 //	rt_hw_interrupt_install(VIC_ETHERNET, nic_isr_handler, RT_NULL);
 //	rt_hw_interrupt_umask(VIC_ETHERNET);

	VICIntSelect       &= ~(1 << VIC_ETHERNET);                         /* Configure the Ethernet VIC interrupt source for IRQ      */
	VICVectAddr21       =  (CPU_INT32U)nic_isr_handler;              /* Set the vector address                                   */
	VICIntEnable        =  (1 << VIC_ETHERNET);                         /* Enable the VIC interrupt source, but no local sources    */
}



/* ethernet device interface */
INT8U IsTxDescFull( )
{
	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 
	
	if (TxConsumeIndex == (TxProduceIndex+1)%NUM_TX_FRAG)
	{	
		return TRUE;	
	}
	return FALSE;
}
INT8U IsTxDescEmpty( )
{
	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (TxConsumeIndex == TxProduceIndex)
	{
		return OS_TRUE;
	}

	return OS_FALSE;
}
 
#define   MIN(x, y)   ((x)   >   (y)   ?   (y)   :   (x)) 
INT16U lpc24xxether_write_frame( struct pbuf* p )
{
	struct pbuf* q;
	INT8U *pDescBuf = NULL;
	INT8U *pSrcBuf = NULL;
	INT16U nTxBufOffset = 0,nDescOffset = 0,nPduLen = 0,nSendLen = 0;

	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (p == NULL)
		return 0;
 
	pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;

	for (q = p; q != NULL; q = q->next)
	{
		nTxBufOffset = 0;
		if (q && q->len)
		{
			pSrcBuf = (INT8U*) q->payload;

			while( nTxBufOffset < q->len )
			{
				nPduLen = MIN(ETH_FRAG_SIZE-nDescOffset,q->len-nTxBufOffset);
				if (nPduLen)
				{
					memcpy(&pDescBuf[nDescOffset], &pSrcBuf[nTxBufOffset], nPduLen );
					nSendLen += nPduLen;

					if (nSendLen >= p->tot_len)
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_LAST       |        /* No additional descriptors to follow, this is the last    */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}
					else
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}

					nTxBufOffset += nPduLen;
					nDescOffset += nPduLen;
				
					//更新
					if (nDescOffset >= ETH_FRAG_SIZE )
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;
					}
					else if (nSendLen >= p->tot_len)
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						break;
					}
				}
			}
		}							   
	}
	MAC_TXPRODUCEINDEX = TxProduceIndex;
}
/*
* Transmit packet.
*/ 
 
INT8U lpc24xxether_tx( eth_device_t dev, struct pbuf* p)
{
	struct pbuf* q;
	INT8U err = OS_NO_ERR;

	SetLedBlinking(1,1,0);
// 	err = IsTxDescEmpty();
// 	if (err == FALSE)
// 	{
// 		return 0;
// 	}
// 	while(!IsTxDescEmpty())
// 	{
// 		OSTimeDly(5);
// 	}

	/* lock tx operation */
//	rt_sem_take(&tx_sem, RT_WAITING_FOREVER);
	OSSemPend(tx_sem,0,&err);
	lpc24xxether_write_frame (p);
	OSSemPost(tx_sem);

	return 0;
}
/*
*********************************************************************************************************
*                                         NIC_RxGetNRdy()
*
* Description : Determines how many packets we are ready to be processed.
*
* Parameters  : None.
*
* Returns     : Number of NIC buffers that are ready to be processed by the stack.
*********************************************************************************************************
*/ 
static  INT16U  get_rx_pkt_cnt (void)
{
	INT16U     n_rdy;
	INT16U     rxconsumeix;
	INT16U     rxproduceix;

	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;

	if (rxproduceix < rxconsumeix) 
	{ /* If the produce index has wrapped around                  */
		n_rdy   =   NUM_RX_FRAG - rxconsumeix + rxproduceix;
	}
	else
	{ /* If consumeix is < produceix, then no wrap around occured */
		n_rdy   =   rxproduceix - rxconsumeix;
	}

	return (n_rdy);
}

INT16U get_nic_rx_frame_size (void)
{
	INT16U     rxconsumeix;
	INT16U     rxproduceix;
	INT16U     desc_cnt=0 , i =0;
	INT16U     rx_frame_size = 0;
	INT32U   rxstatus;
	INT8U   flag = OS_FALSE;

	INT32U  nRsv =  MAC_RSV;
	INT32U  nSta =  MAC_STATUS;


	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;
	if (rxconsumeix == rxproduceix )
	{
		return rx_frame_size;
	}

	if (rxproduceix < rxconsumeix) 
	{ /* If the produce index has wrapped around                  */
	 	desc_cnt   =   NUM_RX_FRAG - rxconsumeix + rxproduceix;
	}
	else
	{ /* If consumeix is < produceix, then no wrap around occured */
	 	desc_cnt   =   rxproduceix - rxconsumeix;	
	}

	for (i = rxconsumeix;  ; i++)
	{
		rxstatus   =  Rx_Stat[i].Info;   
		rxstatus       &= (RINFO_NO_DESCR    |                       /* Obtain the descriptor error bits                         */
			RINFO_OVERRUN    |
			RINFO_ALIGN_ERR  |
			RINFO_LEN_ERR    |
			RINFO_SYM_ERR    |
			RINFO_CRC_ERR    |
			RINFO_FAIL_FILT);

		if (rxstatus > 0)
	//	if (0)
	 		break;			 
	 	else
		{
			rx_frame_size  =  Rx_Stat[i].Info & RINFO_SIZE;
			rx_frame_size  -= 3;

			if (rxstatus | RINFO_LAST_FLAG)
			{//最后一封
				break;
			}				 
		}
		if (rxproduceix > rxconsumeix)
		{
			if (i >= rxproduceix) //到头了
				break;
		}
		else
		{
			if (i >= NUM_RX_FRAG-1)
			{
				i = 0;
				flag = OS_TRUE;
			}
			if (flag && i >= rxproduceix)
				break;		
		}					
	}
	return rx_frame_size;
}
INT16U get_nic_rx_pkt_size (void)
{
	INT16U   size;
	INT32U   rxstatus;

	rxstatus        =  Rx_Stat[MAC_RXCONSUMEINDEX].Info;             /* Accquire the status word for this desciptor              */

	rxstatus       &= (RINFO_NO_DESCR    |                       /* Obtain the descriptor error bits                         */
		RINFO_OVERRUN    |
		RINFO_ALIGN_ERR  |
		RINFO_LEN_ERR    |
		RINFO_SYM_ERR    |
		RINFO_CRC_ERR    |
		RINFO_FAIL_FILT);

	if (rxstatus > 0)
	{                      /* If any receive errors (except range error) occured       */
		size        =  0;  /* then return 0 so upper layer call NetNIC_RxPktDiscard()  */
	}
	else
	{
		size        =  Rx_Stat[MAC_RXCONSUMEINDEX].Info & RINFO_SIZE;     /* Obtain the fragment size from the status struct pointer  */
		size       -=  3;                                               /* +1 since the size is 0 based, -4 to ignore FCS           */
	}

	if (size < 0) 
	{    /* Ensure that the subtraction didnt cause an underflow     */
		size = 0;
	}

	return (size);  /* Return the size of the current frame  */
}


INT8U  NetIF_IsValidPktSize (INT16U  size)
{
	INT8U  valid;

