wmy2370cn/nxp-lpc/NXP-LPC/V7/Bsp/LPC2468/nic_bsp.c
	valid = DEF_YES;

	if (size  < NET_IF_FRAME_MIN_SIZE)
	{
		valid = DEF_NO;
	}

	if (size  > NET_IF_FRAME_MAX_CRC_SIZE) 
	{
		valid = DEF_NO;
	}

	return (valid);
}


static  CPU_INT32U        NIC_RxNRdyCtr = 0;
static  CPU_INT16U  NIC_RxGetNRdy (void)
{
	INT16U     n_rdy;
	INT16U     rxconsumeix;
	INT16U     rxproduceix;

	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;

	if (rxproduceix < rxconsumeix)
	{                                    /* If the produce index has wrapped around                  */
		n_rdy   =   NUM_RX_FRAG - rxconsumeix + rxproduceix;
	} 
	else
	{                                                            /* If consumeix is < produceix, then no wrap around occured */
		n_rdy   =   rxproduceix - rxconsumeix;
	}

	return (n_rdy);
}
/*********************************************************************************************************
** 函数名称: lpc24xxether_read_frame
** 函数名称: lpc24xxether_read_frame
**
** 功能描述：  从描述符中读取数据
**
** 输　入:  INT8U * ptr  数据的目的地
** 输　入:  INT32U section_length  目的地长度
** 输　入:  INT32U total      总长
**          
** 输　出:   void
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年8月13日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
INT8U lpc24xxether_read_frame(INT8U* ptr, INT32U section_length, INT32U total)
{
	register INT32U buf_remain, section_remain;
	static INT32U section_read = 0, buf_offset = 0, frame_read = 0;
	static INT8U* src_ptr = RT_NULL;

	INT32U RxProduceIndex = MAC_RXPRODUCEINDEX;
	INT32U RxConsumeIndex = MAC_RXCONSUMEINDEX;	 

	src_ptr = (INT8U *)(rb_descriptors[RxConsumeIndex].Packet );
	/* Loop until we have obtained the required amount of data. */
	section_read = 0;//
	while( section_read < section_length )
	{
		buf_remain = (total - buf_offset);
		section_remain = section_length - section_read;

		if( section_remain > buf_remain )
		{//目标空间够大
			/* more data on section than buffer size */
			memcpy(&ptr[ section_read ], &src_ptr[buf_offset], buf_remain);
			section_read += buf_remain;
			frame_read += buf_remain;

			/* free buffer */
			//rb_descriptors[current_rb_index].Packet &= ~RxDESC_FLAG_OWNSHIP;
			Rx_Stat[MAC_RXCONSUMEINDEX].Info     = 0;                       //Clear status for debugging purposes                      */

			/* move to the next frame. */
			MAC_RXCONSUMEINDEX      = (MAC_RXCONSUMEINDEX + 1) % NUM_RX_FRAG;     

			/* Reset the variables for the new buffer. */
			src_ptr = (INT8U *)(rb_descriptors[MAC_RXCONSUMEINDEX].Packet );
			buf_offset = 0;
		}
		else
		{
			/* more data on buffer than section size */
			memcpy(&ptr[section_read], &src_ptr[buf_offset], section_remain);
			buf_offset += section_remain;
			section_read += section_remain;
			frame_read += section_remain;

			/* finish this read */
			if((frame_read >= total) || (buf_offset >= ETH_FRAG_SIZE))
			{
				/* free buffer */
				Rx_Stat[MAC_RXCONSUMEINDEX].Info     = 0;                       //Clear status for debugging purposes                      */

				/* move to the next frame. */
				MAC_RXCONSUMEINDEX      = (MAC_RXCONSUMEINDEX + 1) % NUM_RX_FRAG;     

				src_ptr = (INT8U*)(rb_descriptors[MAC_RXCONSUMEINDEX].Packet );
				buf_offset = 0;
			}
		}
	}
} 

struct pbuf *lpc24xxether_rx(eth_device_t dev)
{
	struct pbuf *p = RT_NULL;
 
	INT32U RxProduceIndex = MAC_RXPRODUCEINDEX;
	INT32U RxConsumeIndex = MAC_RXCONSUMEINDEX;	 

	struct pbuf* q;
	INT16U  pkt_len = 0;
	INT16U  pkt_cnt = 0;
	INT8U   ret = OS_FALSE;
	
	if (RxProduceIndex == RxConsumeIndex)
		return RT_NULL;
// 	while(RxProduceIndex == RxConsumeIndex  )
//  { //缓冲区为空，继续等待
// 		rt_thread_delay(5);
// 		RxProduceIndex = MAC_RXPRODUCEINDEX;
// 		RxConsumeIndex = MAC_RXCONSUMEINDEX;	 
// 	}

	SetLedBlinking(2,1,0);
	 
	pkt_len = get_nic_rx_frame_size();
	//判断一下 pkt_len 是否有效，如果无效，则丢弃
	ret = NetIF_IsValidPktSize(pkt_len);
	if (ret == OS_FALSE)
	{
		 EMAC_RxPktDiscard();
		 return NULL;
	 }
 
	//
	if (pkt_len)
	{
		p = pbuf_alloc(PBUF_RAW, pkt_len, PBUF_RAM);
		if(p != RT_NULL)
		{
			for(q = p; q != RT_NULL; q= q->next)
				lpc24xxether_read_frame(q->payload, q->len, pkt_len);
		}
		else
		{//如果内存申请不到，那么需要对描述符进行处理，扔掉部分数据包
			//rt_kprintf("no memory in pbuf\n");
			 EMAC_RxPktDiscard();
			 SetLedBlinking(7,5,0);

		}
	}
 
	return p;
}

void update_mac_address(struct rt_lpc24xx_eth* device)
{
	MAC_SA0 = (device->dev_addr[5] << 8) | (device->dev_addr[4]);
	MAC_SA1 = (device->dev_addr[3] << 8)  | (device->dev_addr[2]);
	MAC_SA2 = (device->dev_addr[1] << 8)  | (device->dev_addr[0]);
}


/*********************************************************************************************************
** 函数名称: lpc24xxether_register
** 函数名称: lpc24xxether_register
**
** 功能描述：  注册MAC设备
**
** 输　入:  char * name
**          
** 输　出:   int
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年7月30日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
int lpc24xxether_register(char *name)
{
 	INT8U result;	   
	/* init rt-thread device interface */
  	lpc24xx_device.parent.eth_rx			= lpc24xxether_rx;
  	lpc24xx_device.parent.eth_tx			= lpc24xxether_tx; 

	tx_sem = OSSemCreate(1);
//	rt_sem_init(&tx_sem, "emac", 1, RT_IPC_FLAG_FIFO);
	//与协议栈相关
	result = eth_device_init(& (lpc24xx_device.parent) , (char*)name);
	RT_ASSERT(result == OS_TRUE);
	//MAC PHY硬件的初始化
	lpc24xxether_init( & lpc24xx_device );
	return OS_TRUE;
}
INT8U SetHWAddr( INT8U *pAddr )
{
	if (pAddr)
	{
		memcpy(pAddr,lpc24xx_device.dev_addr, 6);
	}
}


void rt_hw_eth_init()
{
    AppInitTCPIP();
	lpc24xxether_register("E0");	 
}

